 <?php
 echo "<h2>PHP is Fun!</h2>"
 echo "<h2>สมชาย ไปเที่ยวที่ฝรั่งเศส และเข้าพักในโรงแรมแห่งหนึ่ง
เช้าวันแรก เขาลงมาทานอาหารเช้า บริกรก็ทักทายเขาว่า บองชูร์ สมชายก็ตอบกลับไปว่า สมชาย
.
เช้าวันที่สอง เขาก็ลงมาทานอาหารเช้าเหมือนเดิม บริกรคนเดิมก็มาทักทายเขาว่า บองชูร์ สมชายก็ตอบกลับไปว่า สมชาย
คนไทยที่บังเอิญไปพักที่เดียวกัน ก็บอกสมชายว่า เขาไม่ได้ถามชื่อคุณ เขาทักทายเป็นภาษาฝรั่งเศสว่าสวัสดีครับ สมชายก็นึกไปว่าฝรั่งมันพูดว่า บอกชื่อ

เช้าวันที่สาม สมชายก็ลงมาทานอาหารเช้าเหมือนเดิม แต่คราวนี้เขารีบทักบริกรก่อนเลยว่า บองชูร์
บริกรตอบกลับมาว่า สมชาย</h2>"
 ?>
